# PathReinEndSpanhookAlt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinEndSpanhookAlt Property
ParameterTypeId Class See Also
---
"End Hook Angle Alternating"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinEndSpanhookAlt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinEndSpanhookAlt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinEndSpanhookAlt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace